package com.igm.product.entity;

import java.util.ArrayList;

/**
 * User: Amir Nikjoo,  01/25/2016,  10:13 AM
 */
public class PartList extends ArrayList<Part> {

    public PartList(int carType) {
        switch (carType) {
            case 1:
                add(new Part(1, "آرم جلو و عقب سي يلو", 1));
                add(new Part(2, "آرم جلو و عقب ماتيز", 1));
                add(new Part(3, "آهني کوچک توپي سر کمک ماتيز", 1));
                add(new Part(4, "ابرويي زير چراغ جلو ماتيز چپ", 1));
                add(new Part(5, "ابرويي زير چراغ جلو ماتيز راست", 1));
                add(new Part(6, "اورينگ کشويي چرخ جلو دوو", 1));
                add(new Part(7, "اورينگ ليور دسته دنده دوو", 1));
                add(new Part(8, "اورينگ ترموستات دوو", 1));
                add(new Part(9, "اورينگ دلکو دوو", 1));
                add(new Part(10, "اورينگ دلکو ماتيز", 1));
                add(new Part(11, "اورينگ واتر پمپ دوو", 1));
                add(new Part(12, "بست کمربندي اگزوز عقب دوو", 1));
                add(new Part(13, "بوش پلاستيکي پين کلاج دوو", 1));
                add(new Part(14, "بوش خرچنگي ليور دنده (تک اورينگ) دوو", 1));
                add(new Part(15, "بوش رابط خرچنگي ليور دنده (دو اورينگ) دوو", 1));
                add(new Part(16, "بوش کله قندي طبق ماتيز", 1));
                add(new Part(17, "بوش لقي گلويي فرمان دوو", 1));
                add(new Part(18, "بوش مچي طبق دوو", 1));
                add(new Part(19, "بوش ميل فرمان دوو", 1));
                add(new Part(20, "بوش ميل موجگير دوو", 1));
                add(new Part(21, "بوش سيم دوقلو تعويض دنده ماتيز و MVM", 1));
                add(new Part(22, "بوش و پين پدال کلاج دوو", 1));
                add(new Part(23, "پولک آب بزرگ ماتيز ( بغل سيلندر )", 1));
                add(new Part(24, "پولک آب کوچک ماتيز ( سر سيلندر ) ", 1));
                add(new Part(25, "پولک آب بزرگ دوو", 1));
                add(new Part(26, "پولک آب متوسط دوو", 1));
                add(new Part(27, "گل پاش عقب دوو سي يلو", 1));
                add(new Part(28, "پين خرچنگي ليور دنده دوو", 1));
                add(new Part(29, "تشتکي سيلندر چرخ عقب دوو اسپرو", 1));
                add(new Part(30, "تشتکي سيلندر چرخ عقب دوو سي يلو", 1));
                add(new Part(31, "دياق ابرويي سپر جلو سي يلو چپ ", 1));
                add(new Part(32, "دياق ابرويي سپر جلو سي يلو راست", 1));
                add(new Part(33, "دياق خاک اندازي سپر عقب سي يلو چپ ", 1));
                add(new Part(34, "دياق خاک اندازي سپر عقب سي يلو راست", 1));
                add(new Part(35, "دياق خاک اندازي سپر جلو سي يلو چپ ", 1));
                add(new Part(36, "دياق خاک اندازي سپر جلو سي يلو راست", 1));
                add(new Part(37, "دستگيره سقف سي يلو", 1));
                add(new Part(38, "دستگيره مچي در راست سي يلو", 1));
                add(new Part(39, "دسته موتور راست دوو سي يلو", 1));
                add(new Part(40, "دسته موتور عقب گيربکس دوو سي يلو", 1));
                add(new Part(41, "دوشاخه استارت دوو", 1));
                add(new Part(42, "خار تيغي دياق سپر دوو", 1));
                add(new Part(43, "خارملخي ميل کاپوت دوو", 1));
                add(new Part(44, "خار مربعي ته ميل کاپوت دوو", 1));
                add(new Part(45, "شيشه پرژکتور چپ سی يلو", 1));
                add(new Part(46, "شيشه پرژکتور راست سي يلو ", 1));
                add(new Part(47, "شيلنگ واسطه سه راهی آب ماتيز", 1));
                add(new Part(48, "شيلنگ بخاری ماتيز ", 1));
                add(new Part(49, "شيلنگ بخار روغن سی يلو", 1));
                add(new Part(50, "شيلنگ بالاي رادياتور منجيددار سي يلو", 1));
                add(new Part(51, "شيلنگ زانويي کمپرس روغن سي يلو", 1));
                add(new Part(52, "طلق راهنماي جلو چپ ماتيز", 1));
                add(new Part(53, "طلق راهنماي جلو راست ماتيز", 1));
                add(new Part(54, "فنر اگزوز دوو", 1));
                add(new Part(55, "قاب دور پرژکتور سي يلو چپ", 1));
                add(new Part(56, "قاب دور پرژکتور سي يلو راست", 1));
                add(new Part(57, "قاب پلاک جلو سي يلو سفيد", 1));
                add(new Part(58, "قاب پلاک عقب سي يلو سفيد", 1));
                add(new Part(59, "قاب پلاک جلو سي يلو مشکی", 1));
                add(new Part(60, "قاب پلاک عقب سي يلو مشکی", 1));
                add(new Part(61, "قاب تسمه تايم کامل سي يلو", 1));
                add(new Part(62, "قاب دور دستگيره داخل سي يلو ", 1));
                add(new Part(63, "کاپ کشويي چرخ جلو دوو", 1));
                add(new Part(64, "کورکن سيلندر ماتيز", 1));
                add(new Part(65, "کورکن منيفولد ماتيز با واشر", 1));
                add(new Part(66, "گردگير پلوس سمت چرخ دوو", 1));
                add(new Part(67, "گردگير پلوس سمت گيربکس دوو", 1));
                add(new Part(68, "گردگير پلوس سمت چرخ ماتيز", 1));
                add(new Part(69, "گردگير پلوس سمت گيربکس دوو ماتيز", 1));
                add(new Part(70, "گردگير سيلندر چرخ عقب دوو", 1));
                add(new Part(71, "صفحه مشکي پلاستيکي رو بوقي سي يلو", 1));
                add(new Part(72, "گردگير کشويي لبه دار چرخ جلو دوو", 1));
                add(new Part(73, "لاستيک داخل در مخزن کلاج بالا دوو ", 1));
                add(new Part(74, "لاستيک شلنگ روي بوستر دوو", 1));
                add(new Part(75, "لاستيک گرد ته بوستر دوو", 1));
                add(new Part(76, "لاستيک پدال کلاج و ترمز دوو", 1));
                add(new Part(77, "لاستيک پدال گاز دوو", 1));
                add(new Part(78, "لاستيک توپي سر کمک ماتيز", 1));
                add(new Part(79, "لاستيک چاکدار موجگير ماتيز", 1));
                add(new Part(80, "واشر سه گوش گلويِي اگزوز ماتيز اورجينال", 1));
                add(new Part(81, "لاستيک چاکدار موجگير اسپرو اصلي", 1));
                add(new Part(82, "لاستيک دور ليواني دوو", 1));
                add(new Part(83, "لاستيک ضربگير بالا راديات سي يلو", 1));
                add(new Part(84, "لاستيک ضربگير بالا راديات اسپرو", 1));
                add(new Part(85, "لوازم پمپ ترمز سي يلو ( نيمه کامل با فنر )", 1));
                add(new Part(86, "لوازم سيلندر چرخ عقب اسپرو کامل", 1));
                add(new Part(87, "لوازم سيلندر چرخ عقب سي يلو و ماتيز کامل ", 1));
                add(new Part(88, "لوازم کشوئي چرخ جلو دوو ( يکطرف )", 1));
                add(new Part(89, "ليواني کمک کامل دوو", 1));
                add(new Part(90, "ميل موجگير کامل دوو", 1));
                add(new Part(91, "منجيد عقب اگزوز دوو ", 1));
                add(new Part(92, "منجيد وسط اگزوز دوو ", 1));
                add(new Part(93, "واشر اويل پمپ سي يلو", 1));
                add(new Part(94, "واشر اويل پمپ ماتيز", 1));
                add(new Part(95, "واشر در سوپاپ سي يلو", 1));
                add(new Part(96, "واشر در سوپاپ اسپرو", 1));
                add(new Part(97, "واشر کارتل موتور سي يلو (چوب پنبه مشکي)", 1));
                add(new Part(98, "واشر کارتل موتور سي يلو ( ويکتور )", 1));
                add(new Part(99, "واشر کارتل گيربکس دوو ( ويکتور )", 1));
                add(new Part(100, "واشر منيفولد دود سي يلو و ريسر ", 1));
                add(new Part(101, "واشر منيفولد هواي سي يلو و ريسر 94", 1));
                add(new Part(102, "واشر منيفولد هواي ريسر 92", 1));
                add(new Part(103, "واشر منيفولد هواي اسپرو", 1));
                add(new Part(104, "واشر منيفولد دود اسپرو", 1));
                add(new Part(105, "واشر پايه دلکو ماتيز", 1));
                add(new Part(106, "واشر منيفولد هوا اورينگي ماتيز", 1));
                add(new Part(107, "واشر منيفولد دود ماتيز ( فلزي )", 1));
                add(new Part(108, "واشر در سوپاپ ماتيز", 1));
                add(new Part(109, "واشر گلويي اگزوز دوو", 1));
                add(new Part(110, "واشر لاستيکي در روغن موتور دوو", 1));
                add(new Part(111, "واشر لاستيکي در پمپ بنزين دوو", 1));
                add(new Part(112, "هوزينگ ترموستات سي يلو", 1));
                add(new Part(113, "خرطومي هواکش چهار راهي سي يلو", 1));
                add(new Part(114, "مهره کارتل دوو و هيونداي اصلي کره", 1));
                add(new Part(115, "ضربگير دو سر پيچ راديات کولر سي يلو", 1));
                add(new Part(116, "بست بالاي راديات آب سيلو", 1));
                add(new Part(117, "گردگير دور توپي سوئيچ موتور", 1));
                add(new Part(118, "خار آمپولي سپر دوو سي يلو", 1));
                add(new Part(119, "قاب تسمه تايم پاييني ماتيز ", 1));
                add(new Part(120, "قاب دور ضبط دوو سی يلو", 1));
                break;
            case 2:
                add(new Part(200, "بوش جناقي پژو 405 ", 2));
                add(new Part(201, "بوش لبه دار طبق پژو 405 ", 2));
                add(new Part(202, "ميل موجگير پژو 405", 2));
                add(new Part(203, "چاکدار موجگير پژو 405 (دست 4عدد)", 2));
                add(new Part(204, "قرقری فرمان پژو 405", 2));
                add(new Part(205, "سيبک فرمان پژو 405 چپ و راست", 2));
                add(new Part(206, "سيبک زير کمک پژو 405", 2));
                add(new Part(207, "توپي سر کمک پژو 405 ساده ", 2));
                add(new Part(208, "توپي سر کمک پژو 405 ( لبه دار)", 2));
                add(new Part(209, "توپي سر کمک پژو 405 (جديد دو لبه دار)", 2));
                add(new Part(210, "گردگير پلوس سمت چرخ پژو 1800", 2));
                add(new Part(211, "گردگير پلوس 'گيربکس پژو 1800 ", 2));
                add(new Part(212, "گردگير جعبه فرمان (دو سرگشاد) راست", 2));
                add(new Part(213, "گردگير جعبه فرمان ( يکسر گشاد ) چپ", 2));
                add(new Part(215, "دسته موتور زير باتري پژو 405 ", 2));
                add(new Part(216, "دسته موتورگرد پلاستيکی پژو 405", 2));
                add(new Part(217, "دسته موتورگرد فلزی پژو 405", 2));
                add(new Part(218, "دسته موتور دو سر پيچ پژو 405 روغن دار", 2));
                add(new Part(219, "واشر در سوپاپ پژو 405 و پرشيا", 2));
                add(new Part(220, "واشر بغل اگزوز پژو 405 (يک دست)", 2));
                add(new Part(221, "پولي هرزگرد پژو 405", 2));
                add(new Part(222, "اورينگ ترموستات پژو 405 ", 2));
                add(new Part(223, "اورينگ انژکتور پژو 405 و زانتيا (يکدست)", 2));
                add(new Part(224, "لوازم سيلندر چرخ عقب پژو 405 ", 2));
                add(new Part(225, "لوازم سيلندر چرخ عقب سمند ", 2));
                add(new Part(226, "منجيد اگزوز انتها يي پژو 1800 ", 2));
                add(new Part(227, "منجيد اگزوز مياني پژو 1800 ", 2));
                add(new Part(228, "بوش طبق پژو 206 ساده", 2));
                add(new Part(229, "ميل موجگير پژو 206 ", 2));
                add(new Part(230, "سيبک فرمان  پژو 206 چپ و راست", 2));
                add(new Part(231, "قرقری فرمان پژو 206", 2));
                add(new Part(232, "دسته موتور دو سر پيچ  پژو 206 تيپ 5  و زانتيا  ", 2));
                add(new Part(233, "دسته موتورگرد فلزی پژو 206", 2));
                add(new Part(234, "دسته موتورگرد پلاستيکی پژو 206", 2));
                add(new Part(235, "دسته موتور زير باتري پژو 206 ", 2));
                add(new Part(236, "اورينگ پايه فيلتر روغن پژو 206  همه تيپ ها", 2));
                add(new Part(237, "اورينگ انژکتور 206 پرايد و پيکان و آردي", 2));
                add(new Part(238, "واشر گلويي اگزوز پژو 206", 2));
                add(new Part(239, "منجيد اگزوز پژو 206 ", 2));
                add(new Part(240, "لوازم سيلندر چرخ عقب پژو 206", 2));
                break;
            case 3:
/*
            add(new Part(290, "aa", Enums.CarType.Pride));
            add(new Part(291, "ab", Enums.CarType.Pride));
            add(new Part(292, "ac", Enums.CarType.Pride));
            add(new Part(293, "ad", Enums.CarType.Pride));
            add(new Part(294, "ae", Enums.CarType.Pride));
            add(new Part(295, "ba", Enums.CarType.Pride));
            add(new Part(296, "bb", Enums.CarType.Pride));
*/
                add(new Part(300, "دسته موتور شماره  1  پرايد", 3));
                add(new Part(301, "دسته موتور شماره  2  پرايد", 3));
                add(new Part(302, "واشر در سوپاپ پرايد", 3));
                add(new Part(303, "گردگير پلوس سمت چرخ پرايد ", 3));
                add(new Part(304, "گردگير پلوس سه گوش سمت گيربکس پرايد ", 3));
                add(new Part(305, "گردگير جعبه فرمان پرايد  ", 3));
                add(new Part(306, "گردگير بلند سيلندر چرخ جلو پرايد ", 3));
                add(new Part(307, "گردگير کوتاه سيلندر چرخ جلو پرايد ", 3));
                add(new Part(308, "منجيد اگزوز پرايد ", 3));
                add(new Part(309, "لوازم سيلندر چرخ عقب پرايد ", 3));
                add(new Part(310, "لاستيک زير منبع پمپ ترمز پرايد ", 3));
                add(new Part(311, "لاستيک تعادل پرايد", 3));
                add(new Part(312, "لاستيک چاکدار پرايد", 3));
                add(new Part(313, "گردگير بالاي کمک فنر جلو پرايد  ", 3));
                add(new Part(314, "گردگير بالاي کمک فنر عقب پرايد ", 3));
                add(new Part(315, "لاستيک گرد بالاي فنرلول جلو پرايد(بدون لبه)", 3));
                add(new Part(316, "لاستيک گرد بالاي فنرلول عقب پرايد(لبه دار)", 3));
                add(new Part(317, "لاستيکهاي نر و ماده بالا کمک عقب", 3));
                add(new Part(318, "توپی سر کمک پرايد", 3));
                break;
        }
    }

    public PartList() {

    }
}
